In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns

In [9]:
k=[4,7,9,87.9999,40,]

In [10]:
k

[4, 7, 9, 87.9999, 40]

In [11]:
pd.Series(k)

0     4.0000
1     7.0000
2     9.0000
3    87.9999
4    40.0000
dtype: float64

In [16]:
a=np.random.randint(20,50,15)

In [17]:
a

array([28, 31, 20, 25, 46, 27, 43, 26, 28, 23, 38, 40, 27, 36, 28])

In [18]:
a.ndim

1

In [19]:
pd.Series(a)

0     28
1     31
2     20
3     25
4     46
5     27
6     43
7     26
8     28
9     23
10    38
11    40
12    27
13    36
14    28
dtype: int32

In [21]:
a.ndim

1

In [41]:
np.random.seed(1000)
b=np.random.randint(100,200,(6,6))

In [42]:
b

array([[151, 187, 171, 164, 194, 192],
       [101, 161, 100, 189, 145, 140],
       [192, 191, 136, 160, 142, 158],
       [141, 120, 130, 188, 130, 128],
       [130, 177, 182, 128, 185, 193],
       [110, 130, 114, 161, 169, 176]])

In [43]:
b.ndim

2

In [44]:
b.shape

(6, 6)

In [73]:
df=pd.DataFrame(b,columns=['Roll','Name','Age','country','Add','Clg'],index=[182,189,190,198,194,189])
df

     Roll  Name  Age  country  Add  Clg
182   151   187  171      164  194  192
189   101   161  100      189  145  140
190   192   191  136      160  142  158
198   141   120  130      188  130  128
194   130   177  182      128  185  193
189   110   130  114      161  169  176

In [61]:
df.iloc[0]

Roll       151
Name       187
Age        171
country    164
Add        194
Clg        192
Name: 182, dtype: int32

In [64]:
df.iloc[0,0]

151

In [67]:
df.iloc[0,0:3]

Roll    151
Name    187
Age     171
Name: 182, dtype: int32

In [68]:
df.iloc[[0],[0,1,2]]

     Roll  Name  Age
182   151   187  171

In [70]:
df.iloc[[0,5]]

     Roll  Name  Age  country  Add  Clg
182   151   187  171      164  194  192
189   110   130  114      161  169  176

In [78]:
df[['Roll']]

     Roll
182   151
189   101
190   192
198   141
194   130
189   110

In [84]:
df[['Name','Age']]     # or # df.Name

     Name  Age
182   187  171
189   161  100
190   191  136
198   120  130
194   177  182
189   130  114

In [88]:
import seaborn as sns
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic',
 'anagrams',
 'anagrams',
 'anscombe',
 'anscombe',
 'attention',
 'attention',
 'brain_networks',
 'brain_networks',
 'car_crashes',
 'car_crashes',
 'diamonds',
 'diamonds',
 'dots',
 'dots',
 'dowjones',
 'dowjones',
 'exercise',
 'exercise',
 'flights',
 'flights',
 'fmri',
 'fmri',
 'geyser',
 'geyser',
 'glue',
 'glue',
 'healthexp',
 'healthexp',
 'iris',
 'iris',
 'mpg',
 'mpg',
 'penguins',
 'penguins',
 'planets',
 'planets',
 'seaice',
 'seaice',
 'taxis',
 'taxis',
 'tips',
 'tips',
 'titanic',
 'titanic',
 'anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [ ]:
df=sns.